КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="92c5bd39-d761-43bd-97cc-896ab99e46df">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c548e8bf-5d8a-4346-ad11-7346a15a55c4">
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2bb5d9e-b206-4bc7-bae0-62643128676c">
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="581369d9-44ec-4e70-98c7-55ba3307b1e9">
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="185053d9-9762-4036-a99d-ce89c6afcd73">
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="918ed87c-0276-4e11-a450-1d4bb121e1c3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b30444bc-b440-4396-b3ce-d70c3c684ecb">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94a8b47c-9cae-4633-adb3-391049c640d5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed075445-26f4-452d-905d-f3e2e3ebdb25">
    <name>ЗаданиеВыполняет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="aa7fd4d4-d68f-4ceb-ac95-6650eaa94338">
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b9fe414-2272-4679-94d0-f2aad4a40f51">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63702177-349b-4d17-bf16-d6891f186bf0">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f447f68b-e419-49e0-b86a-301f0e7980f4">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42877410-8859-4810-b356-14180c6fd9e4">
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f4077b4-3d45-4d14-9d79-cb03f40f871f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f2c1a2e-cb86-4455-90e2-890834134774">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="fc7e7f69-66c0-4524-9af0-f84439c47b6b">
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="89a28c00-b22c-4a61-a9e9-df53927e4978">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d1923f33-8770-4a7e-892d-1ea3c4e90ad1">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b7d67d85-7e2c-4e0f-bebe-c31e9180e68f">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb6ed3da-0d41-46c3-b5dd-b9fb617c075e">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4f2eb382-0750-4b94-8d10-6be4259cccd6">
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="15b3905e-1f40-4d8c-9f31-cde2f3907a9e">
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="53fe645f-571c-4df4-ade9-2ee78eb589c6">
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="73f69371-efc1-411d-88e3-a54d75fca5fe">
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9b978cb-d533-4778-a7c0-4c5b981f0cf2">
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4a9b3cc0-c14f-42c9-853f-2377c4e71c15">
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="68fb98bd-34a2-44b6-bb6f-97d8ec682ff2">
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d39b5bf7-ae63-4518-9a48-f9131061ff6a">
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f72237d5-29a8-4168-a456-39b76513b45b">
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f0e45492-af13-445e-b5d6-a94ca1031eed">
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыИсполнителейЗаданийНаПеревозку/ТипыИсполнителейЗаданийНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb378302-d95b-4135-bffd-6239a0199221">
  <name>ТипыИсполнителейЗаданийНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a8905e3a-939f-4248-8255-c2c1f39d3143">
    <name>НашаТранспортнаяСлужба</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d5f011ed-9752-4da4-989a-fbf936cffbff">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ВидыДоставки/ВидыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b5ed99b2-7924-4203-a775-513d82ad12f3">
  <name>ВидыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7d4255ab-af6b-402e-a3ad-e6d0703bb735">
    <name>НаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5d97dd16-48c2-4724-8773-9b2adf8c2fa5">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8139626e-8ad5-43ef-8108-a207607b40b5">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c3e7b9be-3656-4800-8e46-0709bd569743">
      <name>ЗаказКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8852b0c5-f552-486c-868f-ebe8ca0b962f">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f1ffdf4f-c0b4-4011-98ad-7cf60a75cbe8">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2b1ed26b-311f-44e7-b202-264198eec52f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0295f24-4ca7-4ca7-865f-4569012cb260">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa374108-b098-4627-8b61-2374cfa17e62">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="680ae0ca-e1f8-48ba-b136-aaa160965f42">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаданиеНаПеревозку/Forms/ФормаДокумента/Module.bsl
&НаСервере
&Вместо("НастроитьПоТипуИсполнителя")
Процедура ОД_НастроитьПоТипуИсполнителя()

	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;
	
	Элементы.Перевозчик.Видимость       = ВыполняетПеревозчик;
	Элементы.Водитель.Видимость         = Истина;
	Элементы.КурьерЭкспедитор.Видимость = Истина;
	Элементы.РеквизитыТТН.Видимость     = ВыполняетПеревозчик
											И Объект.Операция = Перечисления.ВидыДоставки.СоСклада
											И ПолучитьФункциональнуюОпцию("ИспользоватьТТН");
	
	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;
		
	Иначе
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		
		Перевозчик = Объект.Перевозчик;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Вместо("ЗаполнитьСлужебныеРеквизитыМаршрута")
Процедура ОД_ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки)
	
	Результат = Неопределено;
	РассчитатьНаличиеТТН = ПолучитьФункциональнуюОпцию("ИспользоватьТТН") 
		И ПравоДоступа("Чтение", Метаданные.Документы.ТранспортнаяНакладная);
		
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Распоряжения.КлючСвязи,
	|	Распоряжения.НомерСтроки
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	&Распоряжения КАК Распоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Маршрут.НомерСтроки,
	|	Маршрут.КлючСвязи
	|ПОМЕСТИТЬ Маршрут
	|ИЗ
	|	&Маршрут КАК Маршрут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.Склад,
	|	Распоряжения.Перевозчик,
	|	Распоряжения.ПолучательОтправитель,
	|	Маршрут.НомерСтроки КАК НомерСтрокиМаршрута,
	|	Распоряжения.НомерСтроки КАК НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ РаспоряженияПоМаршрутам
	|ИЗ
	|	Маршрут КАК Маршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Распоряжения КАК Распоряжения
	|		ПО Маршрут.КлючСвязи = Распоряжения.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка КАК Накладная,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ПОМЕСТИТЬ НакладныеПоЗаданиямНаПеревозку
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказНаПеремещение
	|			И Распоряжения.Склад = ДокументТовары.Ссылка.СкладОтправитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//++ НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаСырьяПереработчику.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказПереработчику
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	ДокументТовары.Ссылка,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ДокументТовары
	|		ПО Распоряжения.Распоряжение = ДокументТовары.ЗаказКлиента
	|			И Распоряжения.Склад = ДокументТовары.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	//-- НЕ УТ
	|
	|ВЫБРАТЬ
	|	Распоряжения.Адрес,
	|	Распоряжения.Распоряжение,
	|	Распоряжения.НомерСтрокиРаспоряжений
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК Распоряжения
	|ГДЕ
	|	(Распоряжения.Распоряжение ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПеремещениеТоваров
	//++ НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаСырьяПереработчику
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ПередачаТоваровХранителю
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ОтгрузкаТоваровСХранения
	//-- НЕ УТ
	|			ИЛИ Распоряжения.Распоряжение ССЫЛКА Документ.ВозвратТоваровПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений КАК НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.НомерСтрокиМаршрута) КАК НомерСтрокиМаршрута,
	|	МАКСИМУМ(НЕ ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка ЕСТЬ NULL ) КАК ТранспортнаяНакладнаяОформлена,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик) КАК Перевозчик,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель) КАК ПолучательОтправитель
	|ИЗ
	|	РаспоряженияПоМаршрутам КАК РаспоряженияПоМаршрутам
	|		ЛЕВОЕ СОЕДИНЕНИЕ НакладныеПоЗаданиямНаПеревозку КАК НакладныеПоЗаданиямНаПеревозку
	|		ПО РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений = НакладныеПоЗаданиямНаПеревозку.НомерСтрокиРаспоряжений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснованияОснования
	|		ПО (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.АдресДоставки = НакладныеПоЗаданиямНаПеревозку.Адрес)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.ДокументОснование = НакладныеПоЗаданиямНаПеревозку.Накладная)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.ЗаданиеНаПеревозку = &ЗаданиеНаПеревозку)
	|			И (ТранспортнаяНакладнаяДокументыОснованияОснования.Ссылка.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияПоМаршрутам.НомерСтрокиРаспоряжений
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиМаршрута,
	|	НомерСтрокиРаспоряжений,
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.Перевозчик),
	|	МАКСИМУМ(РаспоряженияПоМаршрутам.ПолучательОтправитель)";
	
	Запрос.УстановитьПараметр("Распоряжения", Объект.Распоряжения.Выгрузить());
	Если ОбновляемыеСтроки = Неопределено Тогда
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут.Выгрузить(ОбновляемыеСтроки));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",	Объект.Ссылка);
		
	Результат = Запрос.Выполнить().Выбрать();
	ШаблонСПеревозчиком = НСтр("ru = '%Перевозчик% (для %ПолучателиОтправители%)'");
	Пока Результат.СледующийПоЗначениюПоля("НомерСтрокиМаршрута") Цикл
		
		СтрокаМаршрута = Объект.Маршрут[Результат.НомерСтрокиМаршрута - 1];
		ПолучателиОтправителиПоПункту = "";
		ТранспортнаяНакладнаяОформлена = Ложь;
		КоличествоРаспоряжений = 0;
		
		Пока Результат.СледующийПоЗначениюПоля("Перевозчик") Цикл
			
			ПолучателиОтправителиПоПеревозчику = "";
			Пока Результат.СледующийПоЗначениюПоля("ПолучательОтправитель") Цикл
				
				Пока Результат.Следующий() Цикл
					КоличествоРаспоряжений = КоличествоРаспоряжений + 1;
					ТранспортнаяНакладнаяОформлена = Макс(ТранспортнаяНакладнаяОформлена, Результат.ТранспортнаяНакладнаяОформлена);
				КонецЦикла;
				
				ПолучателиОтправителиПоПеревозчику = ПолучателиОтправителиПоПеревозчику + Результат.ПолучательОтправитель + "," + " ";
			КонецЦикла;
			ПолучателиОтправителиПоПеревозчику = Лев(ПолучателиОтправителиПоПеревозчику, СтрДлина(ПолучателиОтправителиПоПеревозчику)-2);
			Если ЗначениеЗаполнено(Результат.Перевозчик) Тогда
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ШаблонСПеревозчиком, "%ПолучателиОтправители%", ПолучателиОтправителиПоПеревозчику);
				ПолучателиОтправителиПоПеревозчику = СтрЗаменить(ПолучателиОтправителиПоПеревозчику, "%Перевозчик%", Результат.Перевозчик);
			КонецЕсли;
			ПолучателиОтправителиПоПункту = ПолучателиОтправителиПоПункту + ПолучателиОтправителиПоПеревозчику + "," + " ";
		КонецЦикла;
		
		СтрокаМаршрута.ПолучателиОтправители = ПолучателиОтправителиПоПункту
			+ СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(КоличествоРаспоряжений, НСтр("ru = 'распоряжение, распоряжения, распоряжений'"))
			+ НСтр("ru = '...'");
		
		Если РассчитатьНаличиеТТН Тогда
			СтрокаМаршрута.ТранспортнаяНакладнаяОформлена = ТранспортнаяНакладнаяОформлена;
		КонецЕсли;
		
		СтрокаМаршрута.ВремяСБезДаты   = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяС);
		СтрокаМаршрута.ВремяПоБезДаты  = ДоставкаТоваровКлиентСервер.ВремяБезДаты(СтрокаМаршрута.ВремяПо);

		КА = ОД_Логистика.ПолучитьКонтактыИзАдреса(СтрокаМаршрута.Адрес);
		МассивКА = Новый Массив;
		Если НЕ ПустаяСтрока(КА.КонтактноеЛицо) Тогда
			МассивКА.Добавить(КА.КонтактноеЛицо);
		КонецЕсли;
		Если НЕ ПустаяСтрока(КА.Телефон) Тогда
			МассивКА.Добавить(КА.Телефон);
		КонецЕсли;
		КонтактыИзАдресаСтрока = СтрСоединить(МассивКА, " т.: ");
		СтрокаМаршрута.Контакты = КонтактыИзАдресаСтрока;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
&Вместо("Подключаемый_ВыполнитьКоманду")
Процедура ОД_Подключаемый_ВыполнитьКоманду(Команда)
	
	ИмяПФ = "ЗаявкаАвтотранспортаВер2";
	
	Если Команда.Имя = "ПодменюПечатьОбычное_" + ИмяПФ Тогда
		
		ДополнительныеПараметры = Новый Структура();
		
		ТекущийОбъектПечати = Новый Массив;
		ТекущийОбъектПечати.Добавить(Объект.Ссылка);
		
		Для каждого Пункт Из Объект.Маршрут Цикл
			Если Пункт.Доставлено Тогда
				ТекущийОбъектПечати.Добавить(Пункт.КлючСвязи);
			КонецЕсли;
		КонецЦикла;
		
		ТекМенеджерПечати = "Обработка." + ИмяПФ;
		ИД_ПечатнойФормы = "ВнешняяПечатнаяФорма." + ИмяПФ; 
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ТекМенеджерПечати, ИД_ПечатнойФормы, ТекущийОбъектПечати, ЭтотОбъект, ДополнительныеПараметры);
	Иначе	
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	КонецЕсли;
	
КонецПроцедуры

#Область КомандыФормы
	
Функция ПолучитьМассивРаспоряжений(п_ВыделенныеСтроки)
	
	Рез = Новый Массив;
	
	Для Каждого ИдентификаторСтроки Из п_ВыделенныеСтроки Цикл
		ТекущаяСтрока = Объект.Маршрут.НайтиПоИдентификатору(ИдентификаторСтроки);
		КлючСвязи = ТекущаяСтрока.КлючСвязи;
		СтруктураПоиска = Новый Структура("Распоряжение, Склад");
		НайденныеСтроки = Объект.Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи",КлючСвязи));
		Для Каждого СтрокаРаспоряжений Из НайденныеСтроки Цикл
			Рез.Добавить(СтрокаРаспоряжений.Распоряжение);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Рез;

КонецФункции // ()

&НаКлиенте
Процедура ОД_СоздатьДокументПриобретениеУслугПосле(Команда)

	МассивСтрок = Элементы.Маршрут.ВыделенныеСтроки;
	
	МассивЗаказов = ПолучитьМассивРаспоряжений(МассивСтрок);
	
	Если МассивЗаказов.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
		ПараметрыФормы.Вставить("МассивЗаказов", МассивЗаказов);
		
		ОткрытьФорму("Документ.ПриобретениеУслугПрочихАктивов.ФормаОбъекта", ПараметрыФормы);		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
